# Задача 1
# Найти сумму чисел списка стоящих на нечетной позиции
# Пример: [1, 2, 3, 4] -> 4
def sum_odd(list):
    sum = 0
    for i in range(0, len(list), 2):
        sum += list[i]
    return sum


list = [1, 2, 3, 4]
print("Задача 1")
print(f"Сумма чисел на нечетных позициях списка {list}: {sum_odd(list)}")

# Задача 2
# Найти произведение пар чисел в списке. Парой считаем первый и последний элемент, второй и предпоследний и т.д.
# Пример: [2, 3, 4, 5, 6] => [12, 15, 16]; [2, 3, 5, 6] => [12, 15]


def prod_pairs(list):
    size = len(list)//2 + len(list) % 2
    prod = [0]*size
    for i in range(size):
        prod[i] = (list[i]*list[-1-i])
    return prod


l1 = [2, 3, 8, 5, 6]
l2 = [2, 3, 5, 6]
print("----------------------\nЗадача 2")
print(f"Произведение пар чисел в списке {l1} -> {prod_pairs(l1)}")
print(f"Произведение пар чисел в списке {l2} -> {prod_pairs(l2)}")
